app/controllers/users_controller.rb

  def index
    @users = User.all
    @users_filter = User.where(id: 1..399)
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE ("users"."id" BETWEEN 15 AND 55)

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fartin martin"], ["email", "martylavin1@gmail.com"], ["created_at", "2015-12-06 05:09:33.944638"], ["updated_at", "2015-12-06 05:09:33.944638"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "The Midway Kid"], ["updated_at", "2015-12-07 00:25:20.784014"], ["id", 4]]